USE OutpatientClinicDoctorDB
IF OBJECT_ID('tb_Herb') IS NOT NULL
DROP TABLE tb_Herb;
GO
CREATE TABLE tb_Herb
	(No
		INT IDENTITY(1,1)/*IDENTITY(1,1)：自增长，起始值1，增量1*/
		NOT NULL
	CONSTRAINT pk_Herb_No
		PRIMARY KEY(No)
	,Name
		VARCHAR(50)
	,Pinyin
		VARCHAR(50)
	,CategoryNo
		INT
		CONSTRAINT fk_Herb_CategoryNo
		FOREIGN KEY (CategoryNo)
		REFERENCES tb_HerbCategory(No)
		ON DELETE NO ACTION
		ON UPDATE CASCADE
	,Efficacy
		VARCHAR(250)
	,Price
		DECIMAL(18,2))
		
INSERT INTO tb_Herb
	(Name,Pinyin,CategoryNo,Efficacy,Price)
	VALUES
	('麻黄','mahuang',1,'性味辛微苦温，归肺、膀胱经，具有发汗散寒、宣肺平喘、利水消肿的功效',0.05),
	('薄荷','bohe',2,'性味辛凉，归肝肺经，具有疏散风热、清利头目、利咽、透疹的功效',0.01),
	('升麻','shengma',2,'性味辛甘微寒，归肺脾胃大肠经，可发表透疹、清热解毒、升阳举陷',0.17),
	('桑叶','sangye',2,'性味苦甘寒，归肺肝经，具有疏散风热、清肺润燥、平肝明目的作用',0.01),
	('菊花','juhua',2,'性味辛甘苦，微寒，归肺肝经，能疏风清热、解毒明目',0.03),
	('蝉蜕','chantui',2,'性味甘寒，归肺肝经，能疏散风热、透疹、明目退翳、熄风止痉',0.70),
	('柴胡','chaihu',2,'性味苦辛微寒，归心包络、肝、三焦、胆经，有和解退热、疏肝解郁、升举阳气的效果',0.22),
	('葛根','gegen',2,'性味甘辛凉，归脾胃经，能解肌退热、透发麻疹、生津止渴、生阳止泻',0.21),
	('知母','zhimu',3,'性味苦寒，归肺胃肾经，具有清热泻火、滋阴润燥的功效',0.34),
	('金银花','jinyinhua',4,'性味甘寒，归肺心胃经，具有清热解毒、疏散风热的功效',0.18),
	('黄连','huanglian',5,'性味苦寒，归心脾胃肝胆大肠经，具有清热燥湿、泻火解毒的功效',0.35),
	('大黄','dahuang',6,'性味苦寒，归脾胃大肠肝心经，具有泻下攻积、清热泻火、凉血解毒、逐瘀通经的功效',0.28),
	('郁李仁','yuliren',7,'性味辛苦甘平，归大肠小肠经，具有润肠通便、下气利水的功效',0.29),
	('独活','duhuo',8,'性味辛苦微温，归肾膀胱经，具有祛风除湿、通痹止痛的功效',0.35),
	('防己','fangji',9,'性味苦辛寒，归膀胱肺脾经，具有祛风止痛、利水消肿的功效',0.48),
	('茯苓','fuling',10,'性味甘淡平，归心肺脾肾经，具有利水渗湿、健脾宁心的功效',0.08),
	('车前子','cheqianzi',11,'性味甘寒，归肾肝肺经，具有清热利尿、渗湿止泻、明目祛痰的功效',0.29),
	('干姜','ganjiang',12,'性味辛热，归脾胃心肺经，具有温中散寒、回阳通脉、温肺化饮的功效',0.12),
	('附子','fuzi',13,'性味辛甘大热，归心肾脾经，具有回阳救逆、补火助阳、散寒止痛的功效',0.39),
	('陈皮','chenpi',14,'性味辛苦温，归脾胃肺经，具有理气健脾、燥湿化痰的功效',0.44),
	('沉香','chenxiang',15,'性味辛苦温，归脾胃肾经吗，具有行气止痛、温中止呕、纳气平喘的功效',0.89),
	('山楂','shanzha',16,'性味酸甘微温，归脾胃肝经，具有消食化积、行气散瘀的功效',0.25),
	('侧柏叶','cebaiye',17,'性味苦涩寒，归肺肝大肠经，具有凉血止血、化痰止咳、生发乌发的功效',0.11),
	('三七','sanqi',18,'性味甘微苦温，归肝胃经，具有散瘀止血、消肿定痛的功效',0.36),
	('川穹','chuanqiong',19,'性味辛温，归肝胆心包经，具有活血行气、祛风止痛的功效',0.39),
	('丹参','danshen',20,'性味苦微寒，归心肝经，具有活血祛瘀、通经止痛、清心除烦、凉血消痈的功效',0.59),
	('人参','renshen',21,'性味甘微苦微温，归脾肺心经，具有大补元气、复脉固脱、补脾益肺、生津养血、安神益智的功效',0.93),
	('鹿茸','lurong',22,'性味甘咸温，归肾肝经，具有壮肾阳、益精血、强筋骨、调冲任、托疮毒的功效',1.34),
	('当归','danggui',23,'性味甘辛温，归肝心脾经，具有补血活血、调经止痛、润肠通便的功效',0.67),
	('麦冬','maidong',24,'性味甘微苦微寒，归心、肺、胃经，具有养阴润肺、益胃生津、清心除烦的功效',0.32),
	('朱砂','zhusha',25,'性味甘，性微寒，有毒，归心经，具有清心镇惊、安神明目、解毒的功效',0.45),
	('远志','yuanzhi',25,'性味苦辛温，归心、肾、肺经，具有安神益智、祛痰、消肿的功效',0.36)

SELECT * FROM tb_Herb
